In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/

In [2]:
%%sql

show databases;

 * mysql+mysqlconnector://root:***@localhost/
7 rows affected.

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('placements_prep',),
 ('sakila',),
 ('sys',),
 ('world',)]

In [7]:
%%sql

drop database if exists constraints;
create database constraints;
show databases;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
1 rows affected.
9 rows affected.

[('constraints',),
 ('contraints',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('placements_prep',),
 ('sakila',),
 ('sys',),
 ('world',)]

In [9]:
%%sql

use contraints;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [18]:
%%sql

drop table if exists rides;

CREATE TABLE rides(
    # ride_id INT PRIMARY KEY,
    ride_id INT UNIQUE,
    driver_id INT NOT NULL,
    rider_id INT NOT NULL,
    pickup_location VARCHAR(100) NOT NULL,
    dropoff_location VARCHAR(100) NOT NULL,
    ride_date DATETIME NOT NULL,
    fare DECIMAL(10, 2) NOT NULL,
    PRIMARY KEY (ride_id, rider_id)
);

CREATE TABLE

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [19]:
%%sql

desc rides;

 * mysql+mysqlconnector://root:***@localhost/
7 rows affected.

[('ride_id', 'int', 'NO', 'PRI', None, ''),
 ('driver_id', 'int', 'NO', '', None, ''),
 ('rider_id', 'int', 'NO', 'PRI', None, ''),
 ('pickup_location', 'varchar(100)', 'NO', '', None, ''),
 ('dropoff_location', 'varchar(100)', 'NO', '', None, ''),
 ('ride_date', 'datetime', 'NO', '', None, ''),
 ('fare', 'decimal(10,2)', 'NO', '', None, '')]

In [21]:
#  1. PRIMARY KEY Constraint
# ==========================
# When trying to insert a duplicate value into a PRIMARY KEY column, it will fail because primary keys must be unique.

In [23]:
%%sql
drop table if exists rides;

CREATE TABLE rides (
    ride_id INT PRIMARY KEY,
    driver_id INT NOT NULL,
    rider_id INT NOT NULL,
    pickup_location VARCHAR(100) NOT NULL,
    dropoff_location VARCHAR(100) NOT NULL,
    ride_date DATETIME NOT NULL,
    fare DECIMAL(10, 2) NOT NULL
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [27]:
%%sql
INSERT INTO rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(1, 101, 201, 'Chennai', 'Coimbatore', '2024-12-29 08:00:00', 500.00);

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [28]:
%%sql
INSERT INTO rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(1, 102, 202, 'Bangalore', 'Hyderabad', '2024-12-29 10:00:00', 800.00);

 * mysql+mysqlconnector://root:***@localhost/
(mysql.connector.errors.IntegrityError) 1062 (23000): Duplicate entry '1' for key 'rides.PRIMARY'
[SQL: INSERT INTO rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(1, 102, 202, 'Bangalore', 'Hyderabad', '2024-12-29 10:00:00', 800.00);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [29]:
# Explanation:  
# The second INSERT statement will fail because the ride_id is a PRIMARY KEY, and 1 is already used in the table. Primary keys must be unique.

In [32]:

%%sql

# 2. UNIQUE Constraint 
# =======================
# The UNIQUE constraint ensures that no two rows can have the same value in a column, but allows NULL values. If you try to insert a duplicate value in a column with a UNIQUE constraint, it will fail.

#  Example:

CREATE TABLE users (
    user_id INT PRIMARY KEY,
    email VARCHAR(100) UNIQUE
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [35]:
%%sql

INSERT INTO users (user_id, email)
VALUES (1, 'user1@example.com');  -- First row, valid unique email

INSERT INTO users (user_id, email)
VALUES (2, 'user2@example.com');  -- Second row, valid unique email

INSERT INTO users (user_id, email)
VALUES (3, NULL);  -- Third row, valid as NULL is allowed

# INSERT INTO users (user_id, email)
# VALUES (4, 'user1@example.com');  -- Fails, duplicate non-NULL email

INSERT INTO users (user_id, email)
VALUES (5, NULL);  -- Valid, second NULL value is allowed

# Explanation:
# You can insert multiple NULL values because NULL is not considered a value in the traditional sense, so they are treated as distinct.

# However, non-NULL values must be unique in the column.
# In this example:

# The email column can have one or more NULL values, but each non-NULL email must be unique.
# ---

 * mysql+mysqlconnector://root:***@localhost/
(mysql.connector.errors.ProgrammingError) 1046 (3D000): No database selected
[SQL: INSERT INTO users (user_id, email)
VALUES (1, 'user1@example.com');  -- First row, valid unique email]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [37]:
# 3. NOT NULL Constraint Failure

# The NOT NULL constraint ensures that a column cannot contain NULL values. If you try to insert a NULL value into a NOT NULL column, the operation will fail.

#  Example: